lib_app/app/controllers/libraries_controller.rb

  def index
    @libraries = Library.all
---
SELECT "libraries".* FROM "libraries"

  def create
    @library = Library.create(library_params)
---
INSERT INTO "libraries" ("name", "floor_count", "floor_area", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "library"], ["floor_count", 2], ["floor_area", 3], ["created_at", "2016-05-04 18:18:10.299488"], ["updated_at", "2016-05-04 18:18:10.299488"]]

  def show
    @library = Library.find_by_id(params[:id])
---
SELECT  "libraries".* FROM "libraries" WHERE "libraries"."id" = $1 LIMIT 1  [["id", 1]]